app/Models/Plan.php

    public function profilesAvailable($filter = null)
    {
        $profiles = Profile::whereNotIn('profiles.id', function($query) {
            $query->select('plan_profile.profile_id');
            $query->from('plan_profile');
            $query->whereRaw("plan_profile.plan_id={$this->id}");
        })
        ->where(function ($queryFilter) use ($filter) {
            if ($filter)
                $queryFilter->where('profiles.name', 'LIKE', "%{$filter}%");
        })
        ->paginate();
---
select count(*) as aggregate from `profiles` where `profiles`.`id` not in (select `plan_profile`.`profile_id` from `plan_profile` where plan_profile.plan_id=3)