app/Models/Traits/UserACLTrait.php

select * from `plans` where `plans`.`id` in (3)
select * from `tenants` where `id` = 3 limit 1
select `permissions`.*, `permission_profile`.`profile_id` as `pivot_profile_id`, `permission_profile`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_profile` on `permissions`.`id` = `permission_profile`.`permission_id` where `permission_profile`.`profile_id` in (3)
select `profiles`.*, `plan_profile`.`plan_id` as `pivot_plan_id`, `plan_profile`.`profile_id` as `pivot_profile_id` from `profiles` inner join `plan_profile` on `profiles`.`id` = `plan_profile`.`profile_id` where `plan_profile`.`plan_id` in (3)
---
    public function permissionsPlan(): array
    {
        //Esse metodo retorna as permissoes do plano cujo a empresa assinou

        // $tenant = $this->tenant()->first();
        // $plan =  $tenant->plan;
        //A consulta acima será otimizada abaixo.

        $tenant = Tenant::with('plan.profiles.permissions')->where('id',$this->tenant_id)->first();

select `permissions`.*, `permission_role`.`role_id` as `pivot_role_id`, `permission_role`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_role` on `permissions`.`id` = `permission_role`.`permission_id` where `permission_role`.`role_id` in (1)
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 4
---
    public function permissionsRole(): array
    {
        //Esse metodo retorna as permissoes de cargos de usuarios

        $roles = $this->roles()->with('permissions')->get();