app/Http/Controllers/Admin/ACL/PermissionProfileController.php

    public function permissions($idProfile)
    {
        $profile = $this->profile->find($idProfile);

        if (!$profile) {
            return redirect()->back();
        }

        $permissions = $profile->permissions()->paginate();
---
select `permissions`.*, `permission_profile`.`profile_id` as `pivot_profile_id`, `permission_profile`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_profile` on `permissions`.`id` = `permission_profile`.`permission_id` where `permission_profile`.`profile_id` = 1 limit 15 offset 0
select count(*) as aggregate from `permissions` inner join `permission_profile` on `permissions`.`id` = `permission_profile`.`permission_id` where `permission_profile`.`profile_id` = 1