app/Http/Controllers/Admin/ACL/PlanProfileController.php

    public function profiles($idPlan)
    {
        if (!$plan = $this->plan->find($idPlan)) {
            return redirect()->back();
        }

        $profiles = $plan->profiles()->paginate();
---
select `profiles`.*, `plan_profile`.`plan_id` as `pivot_plan_id`, `plan_profile`.`profile_id` as `pivot_profile_id` from `profiles` inner join `plan_profile` on `profiles`.`id` = `plan_profile`.`profile_id` where `plan_profile`.`plan_id` = 3 limit 15 offset 0
select count(*) as aggregate from `profiles` inner join `plan_profile` on `profiles`.`id` = `plan_profile`.`profile_id` where `plan_profile`.`plan_id` = 3

    public function plans($idProfile)
    {
        if (!$profile = $this->profile->find($idProfile)) {
            return redirect()->back();
        }

        $plans = $profile->plans()->paginate();
---
select `plans`.*, `plan_profile`.`profile_id` as `pivot_profile_id`, `plan_profile`.`plan_id` as `pivot_plan_id` from `plans` inner join `plan_profile` on `plans`.`id` = `plan_profile`.`plan_id` where `plan_profile`.`profile_id` = 3 limit 15 offset 0
select count(*) as aggregate from `plans` inner join `plan_profile` on `plans`.`id` = `plan_profile`.`plan_id` where `plan_profile`.`profile_id` = 3

    public function attachProfilesPlan(Request $request, $idPlan)
    {
        if (!$plan = $this->plan->find($idPlan)) {
            return redirect()->back();
        }

        if (!$request->profiles || count($request->profiles) == 0) {
            return redirect()
                        ->back()
                        ->with('info', 'Precisa escolher pelo menos um plano');
        }

        $plan->profiles()->attach($request->profiles);
---
insert into `plan_profile` (`plan_id`, `profile_id`) values (3, '3')